99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_sys.c
#include "esp32_mquickjs_sys.h"
#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_memory.h"
#include "esp32_mquickjs_options.h"
#include "esp32_mquickjs_version.h"
#include "mquickjs_priv.h"

#include <limits.h>
#include <math.h>
#include <stdlib.h>
#include <string.h>

#include "bootloader_random.h"
#include "esp_chip_info.h"
#include "esp_clk_tree.h"
#include "esp_flash.h"
#include "esp_heap_caps.h"
#include "esp_mac.h"
#include "esp_psram.h"
#include "esp_random.h"
#include "esp_sleep.h"
#include "esp_system.h"
#include "esp_task_wdt.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "mbedtls/private/ctr_drbg.h"
#include "mbedtls/platform_util.h"
#include "soc/clk_tree_defs.h"

#define ESP32_MQUICKJS_MAX_SCOPED_TIMEOUT_MS 60000

static mbedtls_ctr_drbg_context s_secure_random;
static bool s_secure_random_initialized;

static int esp32_secure_random_entropy(void *opaque,
                                       unsigned char *output,
                                       size_t output_length)
{
    (void)opaque;
    esp_fill_random(output, output_length);
    return 0;
}

bool esp32_mquickjs_init_secure_random(JSContext *ctx)
{
    static const unsigned char personalization[] = "esp32qjs.randomHex.v1";
    int result;

    if (s_secure_random_initialized) {
        return true;
    }

    mbedtls_ctr_drbg_init(&s_secure_random);
    /* Seed before any JS-visible RF or ADC module can start using the SAR ADC. */
    bootloader_random_enable();
    result = mbedtls_ctr_drbg_seed(&s_secure_random,
                                   esp32_secure_random_entropy,
                                   NULL,
                                   personalization,
                                   sizeof(personalization) - 1U);
    bootloader_random_disable();
    if (result != 0) {
        mbedtls_ctr_drbg_free(&s_secure_random);
        JS_ThrowInternalError(ctx, "failed to initialize secure random generator: %d", result);
        return false;
    }

    /* Avoid reseeding later while Wi-Fi or ADC may own the entropy hardware. */
    mbedtls_ctr_drbg_set_reseed_interval(&s_secure_random, INT_MAX);
    s_secure_random_initialized = true;
    return true;
}

static const char *esp32_chip_model_name(void)
{
    esp_chip_info_t chip_info;

    esp_chip_info(&chip_info);
    switch (chip_info.model) {
    case CHIP_ESP32:
        return "ESP32";
    case CHIP_ESP32S2:
        return "ESP32-S2";
    case CHIP_ESP32S3:
        return "ESP32-S3";
    case CHIP_ESP32C3:
        return "ESP32-C3";
    case CHIP_ESP32C2:
        return "ESP32-C2";
    case CHIP_ESP32C6:
        return "ESP32-C6";
    case CHIP_ESP32H2:
        return "ESP32-H2";
    case CHIP_ESP32P4:
        return "ESP32-P4";
    case CHIP_ESP32C5:
        return "ESP32-C5";
    case CHIP_ESP32C61:
        return "ESP32-C61";
    default:
        return "ESP32";
    }
}

static bool esp32_hardware_id(char output[16])
{
    static const char hex_digits[] = "0123456789abcdef";
    uint8_t mac[6];
    size_t i;

    if (esp_read_mac(mac, ESP_MAC_EFUSE_FACTORY) != ESP_OK) {
        return false;
    }
    output[0] = 'h';
    output[1] = 'w';
    output[2] = '-';
    for (i = 0; i < sizeof(mac); ++i) {
        output[3 + (i * 2)] = hex_digits[mac[i] >> 4];
        output[4 + (i * 2)] = hex_digits[mac[i] & 0x0f];
    }
    output[15] = '\0';
    return true;
}

static JSValue sys_profile_js_value(JSContext *ctx,
                                    const esp32_mquickjs_profile_value_t *value)
{
    switch (value->type) {
    case ESP32_MQUICKJS_PROFILE_VALUE_INTEGER:
        return JS_NewInt32(ctx, value->value.integer);
    case ESP32_MQUICKJS_PROFILE_VALUE_BOOLEAN:
        return JS_NewBool(value->value.boolean);
    case ESP32_MQUICKJS_PROFILE_VALUE_STRING:
        return JS_NewString(ctx,
                            value->value.string != NULL ? value->value.string : "");
    default:
        return JS_ThrowInternalError(ctx, "hardware profile contains an unsupported value type");
    }
}

static JSValue sys_profile_snapshot(JSContext *ctx)
{
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    size_t count = esp32_mquickjs_profile_count();
    size_t index;

    *object = JS_NewObject(ctx);
    if (JS_IsException(*object)) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    for (index = 0; index < count; ++index) {
        esp32_mquickjs_profile_value_t value;
        const char *key;
        JSValue property;

        if (!esp32_mquickjs_profile_get_at(index, &key, &value)) {
            JS_ThrowInternalError(ctx, "hardware profile enumeration failed");
            JS_PopGCRef(ctx, &object_ref);
            return JS_EXCEPTION;
        }
        property = sys_profile_js_value(ctx, &value);
        if (JS_IsException(property) ||
            !esp32_mquickjs_set_property_ref(ctx, object, key, property)) {
            JS_PopGCRef(ctx, &object_ref);
            return JS_EXCEPTION;
        }
    }
    return JS_PopGCRef(ctx, &object_ref);
}

JSValue js_sys_config(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_profile_value_t value;
    JSCStringBuf key_buf;
    const char *key;

    (void)this_val;
    if (argc == 0) {
        return sys_profile_snapshot(ctx);
    }
    if (!JS_IsString(ctx, argv[0])) {
        return JS_ThrowTypeError(ctx, "sys.config(key) expects a string key");
    }
    key = JS_ToCString(ctx, argv[0], &key_buf);
    if (key == NULL) {
        return JS_EXCEPTION;
    }
    if (!esp32_mquickjs_profile_get(key, &value)) {
        return JS_UNDEFINED;
    }
    return sys_profile_js_value(ctx, &value);
}

static const char *sys_runtime_state_name(esp32_mquickjs_runtime_state_t state)
{
    switch (state) {
    case ESP32_MQUICKJS_RUNTIME_CREATED:
        return "created";
    case ESP32_MQUICKJS_RUNTIME_STARTING:
        return "starting";
    case ESP32_MQUICKJS_RUNTIME_RUNNING:
        return "running";
    case ESP32_MQUICKJS_RUNTIME_QUIESCING:
        return "quiescing";
    case ESP32_MQUICKJS_RUNTIME_RESTARTING:
        return "restarting";
    case ESP32_MQUICKJS_RUNTIME_STOPPING:
        return "stopping";
    case ESP32_MQUICKJS_RUNTIME_STOPPED:
        return "stopped";
    case ESP32_MQUICKJS_RUNTIME_FAILED:
        return "failed";
    default:
        return "failed";
    }
}

