99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_sys.c
static const char *sys_control_action_name(esp32_mquickjs_control_action_t action)
{
    return action == ESP32_MQUICKJS_CONTROL_REBOOT ? "reboot" : "restart-runtime";
}

static const char *sys_restart_failure_action_name(
    esp32_mquickjs_restart_failure_action_t action)
{
    return action == ESP32_MQUICKJS_RESTART_FAILURE_STOP ? "stop" : "reboot";
}

static bool sys_get_host_status(esp32_mquickjs_host_status_t *status)
{
    return esp32_mquickjs_get_host_status(esp32_mquickjs_get_active_runtime(), status);
}

JSValue js_sys_version_get(JSContext *ctx,
                           JSValue *this_val,
                           int argc,
                           JSValue *argv,
                           int magic)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    switch (magic) {
    case 0:
        return JS_NewString(ctx, ESP32QJS_VERSION);
    case 1:
        return JS_NewUint32(ctx, ESP32QJS_HOST_API_VERSION);
    case 2:
        return JS_NewString(ctx, ESP32_MQUICKJS_ENGINE_VERSION);
    case 3:
        return JS_NewString(ctx, esp_get_idf_version());
    default:
        return JS_ThrowInternalError(ctx, "invalid sys.info.version getter");
    }
}

JSValue js_sys_feature_get(JSContext *ctx,
                           JSValue *this_val,
                           int argc,
                           JSValue *argv,
                           int magic)
{
    static const bool features[] = {
#if defined(CONFIG_ESP32_MQUICKJS_FEATURE_FS) && CONFIG_ESP32_MQUICKJS_FEATURE_FS
        true,
#else
        false,
#endif
#if defined(CONFIG_ESP32_MQUICKJS_FEATURE_NVS) && CONFIG_ESP32_MQUICKJS_FEATURE_NVS
        true,
#else
        false,
#endif
#if defined(CONFIG_ESP32_MQUICKJS_FEATURE_GPIO) && CONFIG_ESP32_MQUICKJS_FEATURE_GPIO
        true,
#else
        false,
#endif
#if defined(CONFIG_ESP32_MQUICKJS_FEATURE_LEDC) && CONFIG_ESP32_MQUICKJS_FEATURE_LEDC
        true,
#else
        false,
#endif
#if defined(CONFIG_ESP32_MQUICKJS_FEATURE_ADC) && CONFIG_ESP32_MQUICKJS_FEATURE_ADC
        true,
#else
        false,
#endif
#if defined(CONFIG_ESP32_MQUICKJS_FEATURE_DAC) && CONFIG_ESP32_MQUICKJS_FEATURE_DAC
        true,
#else
        false,
#endif
#if defined(CONFIG_ESP32_MQUICKJS_FEATURE_I2C) && CONFIG_ESP32_MQUICKJS_FEATURE_I2C
        true,
#else
        false,
#endif
#if defined(CONFIG_ESP32_MQUICKJS_FEATURE_SPI) && CONFIG_ESP32_MQUICKJS_FEATURE_SPI
        true,
#else
        false,
#endif
#if defined(CONFIG_ESP32_MQUICKJS_FEATURE_UART) && CONFIG_ESP32_MQUICKJS_FEATURE_UART
        true,
#else
        false,
#endif
#if defined(CONFIG_ESP32_MQUICKJS_FEATURE_USB_SERIAL) && CONFIG_ESP32_MQUICKJS_FEATURE_USB_SERIAL
        true,
#else
        false,
#endif
#if defined(CONFIG_ESP32_MQUICKJS_FEATURE_SOCKET) && CONFIG_ESP32_MQUICKJS_FEATURE_SOCKET
        true,
#else
        false,
#endif
#if defined(CONFIG_ESP32_MQUICKJS_FEATURE_WEBSOCKET) && CONFIG_ESP32_MQUICKJS_FEATURE_WEBSOCKET
        true,
#else
        false,
#endif
#if defined(CONFIG_ESP32_MQUICKJS_FEATURE_BITMAP) && CONFIG_ESP32_MQUICKJS_FEATURE_BITMAP
        true,
#else
        false,
#endif
#if defined(CONFIG_ESP32_MQUICKJS_FEATURE_WIFI) && CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
        true,
#else
        false,
#endif
#if defined(CONFIG_ESP32_MQUICKJS_FEATURE_HTTP) && CONFIG_ESP32_MQUICKJS_FEATURE_HTTP
        true,
#else
        false,
#endif
#if defined(CONFIG_ESP32_MQUICKJS_FEATURE_HTTP_SERVER) && CONFIG_ESP32_MQUICKJS_FEATURE_HTTP_SERVER
        true,
#else
        false,
#endif
#if defined(CONFIG_ESP32_MQUICKJS_FEATURE_RUNTIME_LOGS) && CONFIG_ESP32_MQUICKJS_FEATURE_RUNTIME_LOGS
        true,
#else
        false,
#endif
#if defined(CONFIG_ESP32_MQUICKJS_FEATURE_I2S) && CONFIG_ESP32_MQUICKJS_FEATURE_I2S
        true,
#else
        false,
#endif
#if defined(CONFIG_ESP32_MQUICKJS_FEATURE_CAMERA) && CONFIG_ESP32_MQUICKJS_FEATURE_CAMERA
        true,
#else
        false,
#endif
#if defined(CONFIG_ESP32_MQUICKJS_FEATURE_RPC) && CONFIG_ESP32_MQUICKJS_FEATURE_RPC
        true,
#else
        false,
#endif
#if defined(CONFIG_ESP32_MQUICKJS_FEATURE_RMT) && CONFIG_ESP32_MQUICKJS_FEATURE_RMT
        true,
#else
        false,
#endif
#if defined(CONFIG_ESP32_MQUICKJS_FEATURE_TLS) && CONFIG_ESP32_MQUICKJS_FEATURE_TLS
        true,
#else
        false,
#endif
#if defined(CONFIG_ESP32_MQUICKJS_FEATURE_NET) && CONFIG_ESP32_MQUICKJS_FEATURE_NET
        true,
#else
        false,
#endif
#if defined(CONFIG_ESP32_MQUICKJS_FEATURE_ESPNOW) && CONFIG_ESP32_MQUICKJS_FEATURE_ESPNOW
        true,
#else
        false,
#endif
#if defined(CONFIG_ESP32_MQUICKJS_FEATURE_BLE) && CONFIG_ESP32_MQUICKJS_FEATURE_BLE
        true,
#else
        false,
#endif
#if defined(CONFIG_ESP32_MQUICKJS_FEATURE_WIFI_CSI) && CONFIG_ESP32_MQUICKJS_FEATURE_WIFI_CSI
        true,
#else
        false,
#endif
#if defined(CONFIG_ESP32_MQUICKJS_FEATURE_BITMAP_JPEG) && CONFIG_ESP32_MQUICKJS_FEATURE_BITMAP_JPEG
        true,
#else
        false,
#endif
    };

    (void)this_val;
    (void)argc;
    (void)argv;
    if (magic < 0 || magic >= (int)(sizeof(features) / sizeof(features[0]))) {
        return JS_ThrowInternalError(ctx, "invalid sys.info.features getter");
    }
    return JS_NewBool(features[magic]);
}

JSValue js_sys_hardware_get(JSContext *ctx,
                            JSValue *this_val,
                            int argc,
                            JSValue *argv,
                            int magic)
{
    char hardware_id[16];

    (void)this_val;
    (void)argc;
    (void)argv;
    if (magic == 0) {
        return esp32_hardware_id(hardware_id) ? JS_NewString(ctx, hardware_id) : JS_NULL;
    }
    if (magic == 1) {
        return JS_NewString(ctx, CONFIG_IDF_TARGET);
    }
    return JS_ThrowInternalError(ctx, "invalid sys.info.hardware getter");
}

JSValue js_sys_hardware_chip(JSContext *ctx,
                             JSValue *this_val,
                             int argc,
                             JSValue *argv)
{
    esp_chip_info_t info;
    JSGCRef chip_ref;
    JSGCRef revision_ref;
    JSGCRef capabilities_ref;
    JSValue *chip = JS_PushGCRef(ctx, &chip_ref);
    JSValue *revision = JS_PushGCRef(ctx, &revision_ref);
    JSValue *capabilities = JS_PushGCRef(ctx, &capabilities_ref);

    (void)this_val;
    (void)argc;
    (void)argv;
    esp_chip_info(&info);
    *chip = JS_NewObject(ctx);
    *revision = JS_NewObject(ctx);
    *capabilities = JS_NewObject(ctx);
    if (JS_IsException(*chip) || JS_IsException(*revision) ||
        JS_IsException(*capabilities) ||
        !esp32_mquickjs_set_property_ref(ctx, revision, "raw",
                                         JS_NewUint32(ctx, info.revision)) ||
        !esp32_mquickjs_set_property_ref(ctx, revision, "major",
                                         JS_NewUint32(ctx, info.revision / 100U)) ||
        !esp32_mquickjs_set_property_ref(ctx, revision, "minor",
                                         JS_NewUint32(ctx, info.revision % 100U)) ||
        !esp32_mquickjs_set_property_ref(ctx, capabilities, "embeddedFlash",
                                         JS_NewBool((info.features & CHIP_FEATURE_EMB_FLASH) != 0U)) ||
        !esp32_mquickjs_set_property_ref(ctx, capabilities, "wifi",
                                         JS_NewBool((info.features & CHIP_FEATURE_WIFI_BGN) != 0U)) ||
        !esp32_mquickjs_set_property_ref(ctx, capabilities, "ble",
                                         JS_NewBool((info.features & CHIP_FEATURE_BLE) != 0U)) ||
        !esp32_mquickjs_set_property_ref(ctx, capabilities, "bluetoothClassic",
                                         JS_NewBool((info.features & CHIP_FEATURE_BT) != 0U)) ||
        !esp32_mquickjs_set_property_ref(ctx, capabilities, "ieee802154",
                                         JS_NewBool((info.features & CHIP_FEATURE_IEEE802154) != 0U)) ||
        !esp32_mquickjs_set_property_ref(ctx, capabilities, "embeddedPsram",
                                         JS_NewBool((info.features & CHIP_FEATURE_EMB_PSRAM) != 0U)) ||
        !esp32_mquickjs_set_property_ref(ctx, chip, "model",
                                         JS_NewString(ctx, esp32_chip_model_name())) ||
        !esp32_mquickjs_set_property_ref(ctx, chip, "revision", *revision) ||
        !esp32_mquickjs_set_property_ref(ctx, chip, "cores",
                                         JS_NewUint32(ctx, info.cores)) ||
        !esp32_mquickjs_set_property_ref(ctx, chip, "capabilities", *capabilities)) {
        JS_PopGCRef(ctx, &capabilities_ref);
        JS_PopGCRef(ctx, &revision_ref);
        JS_PopGCRef(ctx, &chip_ref);
        return JS_EXCEPTION;
    }
    JS_PopGCRef(ctx, &capabilities_ref);
    JS_PopGCRef(ctx, &revision_ref);
    return JS_PopGCRef(ctx, &chip_ref);
}

JSValue js_sys_hardware_cpu(JSContext *ctx,
                            JSValue *this_val,
                            int argc,
                            JSValue *argv)
{
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);

    (void)this_val;
    (void)argc;
    (void)argv;
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(
            ctx,
            object,
            "configuredFrequencyHz",
            JS_NewUint32(ctx, (uint32_t)CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ * 1000000U))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

