99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_sys.c
JSValue js_sys_hardware_flash(JSContext *ctx,
                              JSValue *this_val,
                              int argc,
                              JSValue *argv)
{
    uint32_t size_bytes = 0;
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);

    (void)this_val;
    (void)argc;
    (void)argv;
    if (esp_flash_get_size(NULL, &size_bytes) != ESP_OK) {
        size_bytes = 0;
    }
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "sizeBytes",
                                         JS_NewUint32(ctx, size_bytes))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

JSValue js_sys_hardware_psram(JSContext *ctx,
                              JSValue *this_val,
                              int argc,
                              JSValue *argv)
{
    bool enabled = false;
    size_t size_bytes = 0;
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);

    (void)this_val;
    (void)argc;
    (void)argv;
#ifdef CONFIG_SPIRAM
    enabled = esp_psram_is_initialized();
    if (enabled) {
        size_bytes = esp_psram_get_size();
    }
#endif
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "enabled",
                                         JS_NewBool(enabled)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "sizeBytes",
                                         JS_NewUint32(ctx, (uint32_t)size_bytes)) ||
        !esp32_mquickjs_set_property_ref(
            ctx,
            object,
            "mode",
            JS_NewString(ctx, enabled ? ESP32_MQUICKJS_PSRAM_MODE : "none"))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

JSValue js_sys_runtime_info_get(JSContext *ctx,
                                JSValue *this_val,
                                int argc,
                                JSValue *argv,
                                int magic)
{
    esp32_mquickjs_runtime_t *runtime = esp32_mquickjs_get_active_runtime();

    (void)this_val;
    (void)argc;
    (void)argv;
    if (magic != 0) {
        return JS_ThrowInternalError(ctx, "invalid sys.info.runtime getter");
    }
    return JS_NewUint32(ctx,
                        runtime != NULL ? runtime->eval_timeout_ms
                                        : ESP32_MQUICKJS_DEFAULT_EVAL_TIMEOUT_MS);
}

JSValue js_sys_runtime_info_heap(JSContext *ctx,
                                 JSValue *this_val,
                                 int argc,
                                 JSValue *argv)
{
    esp32_mquickjs_runtime_t *runtime = esp32_mquickjs_get_active_runtime();
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);

    (void)this_val;
    (void)argc;
    (void)argv;
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(
            ctx,
            object,
            "sizeBytes",
            JS_NewUint32(ctx, runtime != NULL ? (uint32_t)runtime->js_heap_size : 0U)) ||
        !esp32_mquickjs_set_property_ref(
            ctx,
            object,
            "region",
            JS_NewString(ctx,
                         runtime != NULL && runtime->js_heap_in_psram
                             ? "psram"
                             : "internal"))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

JSValue js_sys_runtime_info_task(JSContext *ctx,
                                 JSValue *this_val,
                                 int argc,
                                 JSValue *argv)
{
    esp32_mquickjs_host_status_t status;
    JSGCRef object_ref;
    JSValue *object;

    (void)this_val;
    (void)argc;
    (void)argv;
    if (!sys_get_host_status(&status)) {
        return JS_ThrowInternalError(ctx, "runtime host status is unavailable");
    }
    if (!status.managed) {
        return JS_NULL;
    }
    object = JS_PushGCRef(ctx, &object_ref);
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "name",
                                         JS_NewString(ctx, status.task_name)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "stackSizeBytes",
                                         JS_NewUint32(ctx, status.task_stack_size)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "priority",
                                         JS_NewUint32(ctx, status.task_priority)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "watchdogEnabled",
                                         JS_NewBool(status.task_watchdog_enabled))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

JSValue js_sys_runtime_info_startup(JSContext *ctx,
                                    JSValue *this_val,
                                    int argc,
                                    JSValue *argv)
{
    esp32_mquickjs_host_status_t status;
    JSGCRef object_ref;
    JSValue *object;

    (void)this_val;
    (void)argc;
    (void)argv;
    if (!sys_get_host_status(&status)) {
        return JS_ThrowInternalError(ctx, "runtime host status is unavailable");
    }
    if (!status.managed) {
        return JS_NULL;
    }
    object = JS_PushGCRef(ctx, &object_ref);
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "script",
                                         JS_NewString(ctx, status.startup_script)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "autorun",
                                         JS_NewBool(status.autorun_startup_script)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "repl",
                                         JS_NewBool(status.repl_enabled))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

JSValue js_sys_runtime_info_filesystem(JSContext *ctx,
                                       JSValue *this_val,
                                       int argc,
                                       JSValue *argv)
{
    esp32_mquickjs_host_status_t status;
    JSGCRef object_ref;
    JSGCRef secondary_ref;
    JSValue *object;
    JSValue *secondary;

    (void)this_val;
    (void)argc;
    (void)argv;
    if (!sys_get_host_status(&status)) {
        return JS_ThrowInternalError(ctx, "runtime host status is unavailable");
    }
    if (!status.managed) {
        return JS_NULL;
    }
    object = JS_PushGCRef(ctx, &object_ref);
    secondary = JS_PushGCRef(ctx, &secondary_ref);
    *object = JS_NewObject(ctx);
    *secondary = JS_NULL;
    if (status.mount_secondary_littlefs) {
        *secondary = JS_NewObject(ctx);
        if (JS_IsException(*secondary) ||
            !esp32_mquickjs_set_property_ref(ctx, secondary, "partition",
                                             JS_NewString(ctx, status.secondary_partition)) ||
            !esp32_mquickjs_set_property_ref(ctx, secondary, "root",
                                             JS_NewString(ctx, status.secondary_root)) ||
            !esp32_mquickjs_set_property_ref(ctx, secondary, "required",
                                             JS_NewBool(status.require_secondary_littlefs))) {
            goto fail;
        }
    }
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "root",
                                         JS_NewString(ctx, status.fs_root)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "mount",
                                         JS_NewBool(status.mount_littlefs)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "required",
                                         JS_NewBool(status.require_littlefs)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "readOnly",
                                         JS_NewBool(status.littlefs_read_only)) ||
        !esp32_mquickjs_set_property_ref(
            ctx,
            object,
            "formatOnMountFail",
            JS_NewBool(status.format_littlefs_on_mount_fail)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "secondary", *secondary)) {
        goto fail;
    }
    JS_PopGCRef(ctx, &secondary_ref);
    return JS_PopGCRef(ctx, &object_ref);

