99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_sys.c
fail:
    JS_PopGCRef(ctx, &secondary_ref);
    JS_PopGCRef(ctx, &object_ref);
    return JS_EXCEPTION;
}

JSValue js_sys_runtime_info_control(JSContext *ctx,
                                    JSValue *this_val,
                                    int argc,
                                    JSValue *argv)
{
    esp32_mquickjs_host_status_t status;
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);

    (void)this_val;
    (void)argc;
    (void)argv;
    if (!sys_get_host_status(&status)) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_ThrowInternalError(ctx, "runtime host status is unavailable");
    }
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "restartRuntime",
                                         JS_NewBool(status.restart_runtime_available)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "reboot",
                                         JS_NewBool(status.reboot_available)) ||
        !esp32_mquickjs_set_property_ref(
            ctx,
            object,
            "restartTimeoutMs",
            status.restart_runtime_available
                ? JS_NewUint32(ctx, status.restart_timeout_ms)
                : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(
            ctx,
            object,
            "restartFailureAction",
            status.restart_runtime_available
                ? JS_NewString(ctx,
                               sys_restart_failure_action_name(status.restart_failure_action))
                : JS_NULL)) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

static const char *sys_reset_reason_name(esp_reset_reason_t reason)
{
    switch (reason) {
    case ESP_RST_POWERON:
        return "power-on";
    case ESP_RST_EXT:
        return "external";
    case ESP_RST_SW:
        return "software";
    case ESP_RST_PANIC:
        return "panic";
    case ESP_RST_INT_WDT:
        return "interrupt-watchdog";
    case ESP_RST_TASK_WDT:
        return "task-watchdog";
    case ESP_RST_WDT:
        return "watchdog";
    case ESP_RST_DEEPSLEEP:
        return "deep-sleep";
    case ESP_RST_BROWNOUT:
        return "brownout";
    case ESP_RST_SDIO:
        return "sdio";
    case ESP_RST_USB:
        return "usb";
    case ESP_RST_JTAG:
        return "jtag";
    case ESP_RST_EFUSE:
        return "efuse";
    case ESP_RST_PWR_GLITCH:
        return "power-glitch";
    case ESP_RST_CPU_LOCKUP:
        return "cpu-lockup";
    case ESP_RST_UNKNOWN:
    default:
        return "unknown";
    }
}

JSValue js_sys_boot_get(JSContext *ctx,
                        JSValue *this_val,
                        int argc,
                        JSValue *argv,
                        int magic)
{
    esp32_mquickjs_runtime_t *runtime = esp32_mquickjs_get_active_runtime();
    esp32_mquickjs_host_status_t status;

    (void)this_val;
    (void)argc;
    (void)argv;
    switch (magic) {
    case 0:
        return runtime != NULL && runtime->boot_id[0] != '\0'
                   ? JS_NewString(ctx, runtime->boot_id)
                   : JS_NULL;
    case 1:
        return JS_NewInt64(ctx, esp_timer_get_time() / 1000);
    case 2:
        if (!sys_get_host_status(&status)) {
            return JS_ThrowInternalError(ctx, "runtime host status is unavailable");
        }
        return status.software_reason_available
                   ? JS_NewString(ctx, status.software_reason)
                   : JS_NULL;
    default:
        return JS_ThrowInternalError(ctx, "invalid sys.status.boot getter");
    }
}

JSValue js_sys_boot_reset(JSContext *ctx,
                          JSValue *this_val,
                          int argc,
                          JSValue *argv)
{
    esp_reset_reason_t reason = esp_reset_reason();
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);

    (void)this_val;
    (void)argc;
    (void)argv;
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "code",
                                         JS_NewInt32(ctx, (int32_t)reason)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "name",
                                         JS_NewString(ctx, sys_reset_reason_name(reason)))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

typedef struct {
    esp_sleep_source_t source;
    const char *name;
} sys_wakeup_name_t;

JSValue js_sys_boot_wakeup(JSContext *ctx,
                           JSValue *this_val,
                           int argc,
                           JSValue *argv)
{
    static const sys_wakeup_name_t wakeup_names[] = {
        { ESP_SLEEP_WAKEUP_EXT0, "ext0" },
        { ESP_SLEEP_WAKEUP_EXT1, "ext1" },
        { ESP_SLEEP_WAKEUP_TIMER, "timer" },
        { ESP_SLEEP_WAKEUP_TOUCHPAD, "touchpad" },
        { ESP_SLEEP_WAKEUP_ULP, "ulp" },
        { ESP_SLEEP_WAKEUP_GPIO, "gpio" },
        { ESP_SLEEP_WAKEUP_UART0, "uart0" },
        { ESP_SLEEP_WAKEUP_UART1, "uart1" },
        { ESP_SLEEP_WAKEUP_WIFI, "wifi" },
        { ESP_SLEEP_WAKEUP_COCPU, "cocpu" },
        { ESP_SLEEP_WAKEUP_COCPU_TRAP_TRIG, "cocpu-trap" },
        { ESP_SLEEP_WAKEUP_BT, "bluetooth" },
    };
    uint32_t mask = esp_sleep_get_wakeup_causes();
    uint32_t known_mask = 0;
    uint32_t index = 0;
    size_t i;
    JSGCRef object_ref;
    JSGCRef names_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *names = JS_PushGCRef(ctx, &names_ref);

    (void)this_val;
    (void)argc;
    (void)argv;
    *object = JS_NewObject(ctx);
    *names = JS_NewArray(ctx, 0);
    if (JS_IsException(*object) || JS_IsException(*names)) {
        goto fail;
    }
    for (i = 0; i < sizeof(wakeup_names) / sizeof(wakeup_names[0]); ++i) {
        uint32_t bit = UINT32_C(1) << (uint32_t)wakeup_names[i].source;

        known_mask |= bit;
        if ((mask & bit) != 0U &&
            JS_IsException(JS_SetPropertyUint32(
                ctx,
                *names,
                index++,
                JS_NewString(ctx, wakeup_names[i].name)))) {
            goto fail;
        }
    }
    if ((mask & ~known_mask) != 0U &&
        JS_IsException(JS_SetPropertyUint32(ctx,
                                            *names,
                                            index,
                                            JS_NewString(ctx, "unknown")))) {
        goto fail;
    }
    if (!esp32_mquickjs_set_property_ref(ctx, object, "mask",
                                         JS_NewUint32(ctx, mask)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "names", *names)) {
        goto fail;
    }
    JS_PopGCRef(ctx, &names_ref);
    return JS_PopGCRef(ctx, &object_ref);

