99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_sys.c
fail:
    JS_PopGCRef(ctx, &names_ref);
    JS_PopGCRef(ctx, &object_ref);
    return JS_EXCEPTION;
}

JSValue js_sys_cpu_frequency(JSContext *ctx,
                             JSValue *this_val,
                             int argc,
                             JSValue *argv)
{
    uint32_t frequency_hz = 0;

    (void)this_val;
    (void)argc;
    (void)argv;
    if (esp_clk_tree_src_get_freq_hz(SOC_MOD_CLK_CPU,
                                     ESP_CLK_TREE_SRC_FREQ_PRECISION_CACHED,
                                     &frequency_hz) != ESP_OK) {
        return JS_NULL;
    }
    return JS_NewUint32(ctx, frequency_hz);
}

static JSValue sys_heap_status(JSContext *ctx, uint32_t capabilities)
{
    multi_heap_info_t info;
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);

    memset(&info, 0, sizeof(info));
    heap_caps_get_info(&info, capabilities);
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(
            ctx,
            object,
            "totalBytes",
            JS_NewUint32(ctx, (uint32_t)(info.total_free_bytes +
                                         info.total_allocated_bytes))) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "freeBytes",
                                         JS_NewUint32(ctx, (uint32_t)info.total_free_bytes)) ||
        !esp32_mquickjs_set_property_ref(
            ctx,
            object,
            "allocatedBytes",
            JS_NewUint32(ctx, (uint32_t)info.total_allocated_bytes)) ||
        !esp32_mquickjs_set_property_ref(
            ctx,
            object,
            "minimumFreeBytes",
            JS_NewUint32(ctx, (uint32_t)info.minimum_free_bytes)) ||
        !esp32_mquickjs_set_property_ref(
            ctx,
            object,
            "largestFreeBlockBytes",
            JS_NewUint32(ctx, (uint32_t)info.largest_free_block)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "allocatedBlocks",
                                         JS_NewUint32(ctx, (uint32_t)info.allocated_blocks)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "freeBlocks",
                                         JS_NewUint32(ctx, (uint32_t)info.free_blocks)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "totalBlocks",
                                         JS_NewUint32(ctx, (uint32_t)info.total_blocks))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

JSValue js_sys_memory_get(JSContext *ctx,
                          JSValue *this_val,
                          int argc,
                          JSValue *argv,
                          int magic)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    switch (magic) {
    case 0:
        return sys_heap_status(ctx, MALLOC_CAP_DEFAULT);
    case 1:
        return sys_heap_status(ctx, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    case 2:
        return sys_heap_status(ctx, MALLOC_CAP_DMA);
    case 3:
#ifdef CONFIG_SPIRAM
        if (esp_psram_is_initialized()) {
            return sys_heap_status(ctx, MALLOC_CAP_SPIRAM);
        }
#endif
        return JS_NULL;
    default:
        return JS_ThrowInternalError(ctx, "invalid sys.status.memory getter");
    }
}

static JSValue sys_wireless_budget_region(JSContext *ctx,
    const esp32_mquickjs_memory_budget_region_t *region)
{
    JSGCRef object_ref, roles_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *roles = JS_PushGCRef(ctx, &roles_ref);
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object)) goto fail;
    *roles = JS_NewObject(ctx);
    if (JS_IsException(*roles)) goto fail;
    for (unsigned role = ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL;
         role < ESP32_MQUICKJS_MEMORY_BUDGET_ROLE_COUNT; ++role) {
        if (!esp32_mquickjs_set_property_ref(ctx, roles,
                esp32_mquickjs_memory_budget_role_name(role),
                JS_NewUint32(ctx, (uint32_t)region->roles[role]))) goto fail;
    }
    if (!esp32_mquickjs_set_property_ref(ctx, object, "limitBytes",
            JS_NewUint32(ctx, (uint32_t)region->limit)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "controlReserveBytes",
            JS_NewUint32(ctx, (uint32_t)region->control_reserve)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "reservedBytes",
            JS_NewUint32(ctx, (uint32_t)region->reserved)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "highWaterBytes",
            JS_NewUint32(ctx, (uint32_t)region->high_water)) ||
        JS_IsException(JS_SetPropertyStr(ctx, *object, "roles", *roles))) goto fail;
    JS_PopGCRef(ctx, &roles_ref);
    return JS_PopGCRef(ctx, &object_ref);
fail:
    JS_PopGCRef(ctx, &roles_ref);
    JS_PopGCRef(ctx, &object_ref);
    return JS_EXCEPTION;
}

static JSValue sys_wireless_budget(JSContext *ctx,
    const esp32_mquickjs_memory_budget_t *budget)
{
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "internal",
            sys_wireless_budget_region(ctx, &budget->regions[0])) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "psram",
            sys_wireless_budget_region(ctx, &budget->regions[1])) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "rejectedReservations",
            JS_NewUint32(ctx, budget->rejected))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

JSValue js_sys_memory_manager(JSContext *ctx,
                              JSValue *this_val,
                              int argc,
                              JSValue *argv)
{
    esp32_mquickjs_memory_status_t status;
    JSGCRef object_ref;
    JSGCRef allocations_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *allocations = JS_PushGCRef(ctx, &allocations_ref);
    size_t index;

    (void)this_val;
    (void)argc;
    (void)argv;
    esp32_mquickjs_memory_get_status(&status);
    *object = JS_NewObject(ctx);
    *allocations = JS_NewArray(ctx, 0);
    if (JS_IsException(*object) || JS_IsException(*allocations)) {
        goto fail;
    }
    for (index = 0; index < status.allocation_count; ++index) {
        const esp32_mquickjs_memory_owner_entry_t *allocation =
            &status.allocations[index];
        JSGCRef allocation_ref;
        JSValue *allocation_object = JS_PushGCRef(ctx, &allocation_ref);

