99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_sys.c
        *allocation_object = JS_NewObject(ctx);
        if (JS_IsException(*allocation_object) ||
            !esp32_mquickjs_set_property_ref(
                ctx, allocation_object, "owner",
                JS_NewString(ctx, allocation->owner)) ||
            !esp32_mquickjs_set_property_ref(
                ctx, allocation_object, "class",
                JS_NewString(
                    ctx, esp32_mquickjs_memory_class_name(
                             (esp32_mquickjs_memory_class_t)
                                 allocation->memory_class))) ||
            !esp32_mquickjs_set_property_ref(
                ctx, allocation_object, "region",
                JS_NewString(
                    ctx, esp32_mquickjs_memory_region_name(
                             allocation->region))) ||
            !esp32_mquickjs_set_property_ref(
                ctx, allocation_object, "bytes",
                JS_NewUint32(ctx, (uint32_t)allocation->bytes)) ||
            !esp32_mquickjs_set_property_ref(
                ctx, allocation_object, "blocks",
                JS_NewUint32(ctx, allocation->blocks))) {
            JS_PopGCRef(ctx, &allocation_ref);
            goto fail;
        }
        if (JS_IsException(JS_SetPropertyUint32(
                ctx, *allocations, (uint32_t)index,
                *allocation_object))) {
            JS_PopGCRef(ctx, &allocation_ref);
            goto fail;
        }
        JS_PopGCRef(ctx, &allocation_ref);
    }
    if (
        !esp32_mquickjs_set_property_ref(ctx, object, "wireless",
            sys_wireless_budget(ctx, &status.wireless)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "pressure",
            JS_NewString(ctx,
                         esp32_mquickjs_memory_pressure_name(status.pressure))) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "internalReserveBytes",
            JS_NewUint32(ctx, (uint32_t)status.internal_reserve_bytes)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "dmaLargestReserveBytes",
            JS_NewUint32(ctx, (uint32_t)status.dma_largest_reserve_bytes)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "managedInternalBytes",
            JS_NewUint32(ctx, (uint32_t)status.managed_internal_bytes)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "managedPsramBytes",
            JS_NewUint32(ctx, (uint32_t)status.managed_psram_bytes)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "pinnedBytes",
            JS_NewUint32(ctx, (uint32_t)status.pinned_bytes)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "driverPinnedBytes",
            JS_NewUint32(ctx, (uint32_t)status.driver_pinned_bytes)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "stagingPinnedBytes",
            JS_NewUint32(ctx, (uint32_t)status.staging_pinned_bytes)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "dmaStagingPools",
            JS_NewUint32(ctx, status.dma_staging_pools)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "pendingDmaReservationBytes",
            JS_NewUint32(
                ctx, (uint32_t)status.pending_dma_reservation_bytes)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "movableIdleBytes",
            JS_NewUint32(ctx, (uint32_t)status.movable_idle_bytes)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "migrationCount",
            JS_NewUint32(ctx, status.migration_count)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "migrationBytes",
            JS_NewUint32(ctx, (uint32_t)status.migration_bytes)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "evictionCount",
            JS_NewUint32(ctx, status.eviction_count)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "allocationFailures",
            JS_NewUint32(ctx, status.allocation_failures)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "allocations", *allocations)) {
        goto fail;
    }
    JS_PopGCRef(ctx, &allocations_ref);
    return JS_PopGCRef(ctx, &object_ref);

fail:
    JS_PopGCRef(ctx, &allocations_ref);
    JS_PopGCRef(ctx, &object_ref);
    return JS_EXCEPTION;
}

JSValue js_sys_rtos_get(JSContext *ctx,
                        JSValue *this_val,
                        int argc,
                        JSValue *argv,
                        int magic)
{
    BaseType_t scheduler_state;

    (void)this_val;
    (void)argc;
    (void)argv;
    switch (magic) {
    case 0:
        return JS_NewString(ctx, "FreeRTOS");
    case 1:
        scheduler_state = xTaskGetSchedulerState();
        if (scheduler_state == taskSCHEDULER_RUNNING) {
            return JS_NewString(ctx, "running");
        }
        if (scheduler_state == taskSCHEDULER_SUSPENDED) {
            return JS_NewString(ctx, "suspended");
        }
        return JS_NewString(ctx, "not-started");
    case 2:
        return JS_NewUint32(ctx, configTICK_RATE_HZ);
    case 3:
        return JS_NewUint32(ctx, uxTaskGetNumberOfTasks());
    case 4:
#if defined(CONFIG_ESP32_MQUICKJS_SYS_TASK_SNAPSHOT) && CONFIG_ESP32_MQUICKJS_SYS_TASK_SNAPSHOT
        return JS_TRUE;
#else
        return JS_FALSE;
#endif
    case 5:
#if defined(CONFIG_ESP32_MQUICKJS_SYS_TASK_SNAPSHOT) && CONFIG_ESP32_MQUICKJS_SYS_TASK_SNAPSHOT
        return JS_NewUint32(ctx, CONFIG_ESP32_MQUICKJS_SYS_TASK_SNAPSHOT_MAX);
#else
        return JS_NewInt32(ctx, 0);
#endif
    default:
        return JS_ThrowInternalError(ctx, "invalid sys.status.rtos getter");
    }
}

JSValue js_sys_rtos_runtime_task(JSContext *ctx,
                                 JSValue *this_val,
                                 int argc,
                                 JSValue *argv)
{
    esp32_mquickjs_host_status_t status;
    const char *name = pcTaskGetName(NULL);
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);

    (void)this_val;
    (void)argc;
    (void)argv;
    if (!sys_get_host_status(&status)) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_ThrowInternalError(ctx, "runtime host status is unavailable");
    }
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "name",
                                         JS_NewString(ctx, name != NULL ? name : "")) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "priority",
                                         JS_NewUint32(ctx, uxTaskPriorityGet(NULL))) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "currentCore",
                                         JS_NewInt32(ctx, portGET_CORE_ID())) ||
        !esp32_mquickjs_set_property_ref(
            ctx,
            object,
            "stackSizeBytes",
            status.managed ? JS_NewUint32(ctx, status.task_stack_size) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(
            ctx,
            object,
            "stackHighWaterMarkBytes",
            JS_NewUint32(ctx, uxTaskGetStackHighWaterMark(NULL))) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "watchdogEnabled",
                                         JS_NewBool(status.task_watchdog_enabled)) ||
        !esp32_mquickjs_set_property_ref(
            ctx,
            object,
            "watchdogRegistered",
            JS_NewBool(esp_task_wdt_status(NULL) == ESP_OK))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

static JSValue sys_pending_control(JSContext *ctx,
                                   const esp32_mquickjs_host_status_t *status)
{
    JSGCRef object_ref;
    JSValue *object;

    if (status == NULL || !status->pending_control) {
        return JS_NULL;
    }
    object = JS_PushGCRef(ctx, &object_ref);
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(
            ctx,
            object,
            "action",
            JS_NewString(ctx, sys_control_action_name(status->pending_action))) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "reason",
                                         JS_NewString(ctx, status->pending_reason)) ||
        !esp32_mquickjs_set_property_ref(
            ctx,
            object,
            "requestedAtMs",
            JS_NewInt64(ctx, (int64_t)status->pending_requested_at_ms)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "dueAtMs",
                                         JS_NewInt64(ctx, (int64_t)status->pending_due_at_ms))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

JSValue js_sys_runtime_status_get(JSContext *ctx,
                                  JSValue *this_val,
                                  int argc,
                                  JSValue *argv,
                                  int magic)
{
    esp32_mquickjs_host_status_t status;
    uint64_t now_us = (uint64_t)esp_timer_get_time();

    (void)this_val;
    (void)argc;
    (void)argv;
    if (!sys_get_host_status(&status)) {
        return JS_ThrowInternalError(ctx, "runtime host status is unavailable");
    }
    switch (magic) {
    case 0:
        return JS_NewString(ctx, sys_runtime_state_name(status.state));
    case 1:
        return JS_NewUint32(ctx, status.generation);
    case 2:
        return JS_NewInt64(ctx,
                           status.generation_started_us <= now_us
                               ? (int64_t)((now_us - status.generation_started_us) / 1000ULL)
                               : 0);
    case 3:
        return JS_NewUint32(ctx, status.restart_count);
    case 4:
        return status.last_restart_reason[0] != '\0'
                   ? JS_NewString(ctx, status.last_restart_reason)
                   : JS_NULL;
    case 5:
        return sys_pending_control(ctx, &status);
    default:
        return JS_ThrowInternalError(ctx, "invalid sys.status.runtime getter");
    }
}

