99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_sys.c
JSValue js_sys_runtime_status_filesystem(JSContext *ctx,
                                         JSValue *this_val,
                                         int argc,
                                         JSValue *argv)
{
    esp32_mquickjs_host_status_t status;
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);

    (void)this_val;
    (void)argc;
    (void)argv;
    if (!sys_get_host_status(&status)) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_ThrowInternalError(ctx, "runtime host status is unavailable");
    }
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "root",
                                         JS_NewString(ctx, status.fs_root)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "mounted",
                                         JS_NewBool(status.littlefs_mounted)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "readOnly",
                                         JS_NewBool(status.littlefs_read_only)) ||
        !esp32_mquickjs_set_property_ref(
            ctx,
            object,
            "secondaryMounted",
            JS_NewBool(status.secondary_littlefs_mounted))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

JSValue js_sys_runtime_status_watchdog(JSContext *ctx,
                                       JSValue *this_val,
                                       int argc,
                                       JSValue *argv)
{
    esp32_mquickjs_host_status_t status;
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    uint64_t now_us = (uint64_t)esp_timer_get_time();
    int64_t heartbeat_age_ms = 0;

    (void)this_val;
    (void)argc;
    (void)argv;
    if (!sys_get_host_status(&status)) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_ThrowInternalError(ctx, "runtime host status is unavailable");
    }
    if (status.last_outer_heartbeat_us > 0 &&
        status.last_outer_heartbeat_us <= now_us) {
        heartbeat_age_ms = (int64_t)(
            (now_us - status.last_outer_heartbeat_us) / 1000ULL);
    }
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "systemEnabled",
                                         JS_NewBool(status.task_watchdog_enabled)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "systemRegistered",
                                         JS_NewBool(status.task_watchdog_registered)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "jsEnabled",
                                         JS_NewBool(status.js_watchdog_enabled)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "jsRegistered",
                                         JS_NewBool(status.js_watchdog_registered)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "timeoutMs",
                                         JS_NewUint32(ctx, status.watchdog_timeout_ms)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "lastOuterHeartbeatAgeMs",
                                         JS_NewInt64(ctx, heartbeat_age_ms))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

JSValue js_sys_runtime_status_startup(JSContext *ctx,
                                      JSValue *this_val,
                                      int argc,
                                      JSValue *argv)
{
    esp32_mquickjs_host_status_t status;
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    const char *phase;

    (void)this_val;
    (void)argc;
    (void)argv;
    if (!sys_get_host_status(&status)) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_ThrowInternalError(ctx, "runtime host status is unavailable");
    }
    phase = status.safe_mode_active ? "safe-mode" :
            status.startup_pending && !status.startup_stabilizing ? "armed" :
            status.startup_stabilizing ? "stabilizing" : "healthy";
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "phase",
                                         JS_NewString(ctx, phase)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "safeModeActive",
                                         JS_NewBool(status.safe_mode_active)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "safeModeRequested",
                                         JS_NewBool(status.safe_mode_requested)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "failureCount",
                                         JS_NewUint32(ctx, status.startup_failure_count)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "failureLimit",
                                         JS_NewUint32(ctx, status.startup_failure_limit)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "healthyAfterMs",
                                         JS_NewUint32(ctx, status.startup_healthy_ms)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "lastFailureReason",
            status.last_startup_failure_reason[0] != '\0'
                ? JS_NewString(ctx, status.last_startup_failure_reason)
                : JS_NULL)) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

JSValue js_sys_safe_mode_get(JSContext *ctx,
                             JSValue *this_val,
                             int argc,
                             JSValue *argv)
{
    esp32_mquickjs_host_status_t status;

    (void)this_val;
    (void)argc;
    (void)argv;
    if (!sys_get_host_status(&status) || !status.safe_mode_available) {
        return JS_ThrowInternalError(ctx, "sys.safeMode is unavailable");
    }
    return JS_NewBool(status.safe_mode_requested);
}

JSValue js_sys_safe_mode_set(JSContext *ctx,
                             JSValue *this_val,
                             int argc,
                             JSValue *argv)
{
    esp32_mquickjs_runtime_t *runtime = esp32_mquickjs_get_active_runtime();

    (void)this_val;
    if (argc != 1 || !JS_IsBool(argv[0])) {
        return JS_ThrowTypeError(ctx, "sys.safeMode expects a boolean");
    }
    if (!esp32_mquickjs_set_safe_mode(runtime, argv[0] == JS_TRUE)) {
        return JS_ThrowInternalError(ctx, "failed to persist sys.safeMode");
    }
    return JS_UNDEFINED;
}

static bool sys_set_resource_object(JSContext *ctx,
                                    JSValue *parent,
                                    const char *name,
                                    JSValue *child)
{
    return !JS_IsException(*child) &&
           esp32_mquickjs_set_property_ref(ctx, parent, name, *child);
}

JSValue js_sys_runtime_status_resources(JSContext *ctx,
                                        JSValue *this_val,
                                        int argc,
                                        JSValue *argv)
{
    esp32_mquickjs_resource_status_t status;
    esp32_mquickjs_runtime_t *runtime = esp32_mquickjs_get_active_runtime();
    JSGCRef resources_ref;
    JSGCRef timers_ref;
    JSGCRef futures_ref;
    JSGCRef event_queues_ref;
    JSGCRef async_pollers_ref;
    JSGCRef orphans_ref;
    JSValue *resources = JS_PushGCRef(ctx, &resources_ref);
    JSValue *timers = JS_PushGCRef(ctx, &timers_ref);
    JSValue *futures = JS_PushGCRef(ctx, &futures_ref);
    JSValue *event_queues = JS_PushGCRef(ctx, &event_queues_ref);
    JSValue *async_pollers = JS_PushGCRef(ctx, &async_pollers_ref);
    JSValue *orphans = JS_PushGCRef(ctx, &orphans_ref);

    (void)this_val;
    (void)argc;
    (void)argv;
    if (!esp32_mquickjs_get_resource_status(runtime, &status)) {
        JS_PopGCRef(ctx, &orphans_ref);
        JS_PopGCRef(ctx, &async_pollers_ref);
        JS_PopGCRef(ctx, &event_queues_ref);
        JS_PopGCRef(ctx, &futures_ref);
        JS_PopGCRef(ctx, &timers_ref);
        JS_PopGCRef(ctx, &resources_ref);
        return JS_ThrowInternalError(ctx, "runtime resource status is unavailable");
    }
    *resources = JS_NewObject(ctx);
    *timers = JS_NewObject(ctx);
    *futures = JS_NewObject(ctx);
    *event_queues = JS_NewObject(ctx);
    *async_pollers = JS_NewObject(ctx);
    *orphans = JS_NewObject(ctx);
    if (JS_IsException(*resources) ||
        !esp32_mquickjs_set_property_ref(ctx, timers, "active",
                                         JS_NewUint32(ctx, status.timers_active)) ||
        !esp32_mquickjs_set_property_ref(ctx, timers, "capacity",
                                         JS_NewUint32(ctx, status.timers_capacity)) ||
        !esp32_mquickjs_set_property_ref(ctx, futures, "queued",
                                         JS_NewUint32(ctx, status.futures_queued)) ||
        !esp32_mquickjs_set_property_ref(ctx, futures, "pending",
                                         JS_NewUint32(ctx, status.futures_pending)) ||
        !esp32_mquickjs_set_property_ref(ctx, futures, "capacity",
                                         JS_NewUint32(ctx, status.futures_capacity)) ||
        !esp32_mquickjs_set_property_ref(ctx, futures, "userCapacity",
                                         JS_NewUint32(ctx, status.futures_user_capacity)) ||
        !esp32_mquickjs_set_property_ref(
            ctx,
            futures,
            "internalReserve",
            JS_NewUint32(ctx, status.futures_internal_reserve)) ||
        !esp32_mquickjs_set_property_ref(ctx, event_queues, "open",
                                         JS_NewUint32(ctx, status.event_queues_open)) ||
        !esp32_mquickjs_set_property_ref(ctx, event_queues, "dropped",
                                         JS_NewUint32(ctx, status.event_queues_dropped)) ||
        !esp32_mquickjs_set_property_ref(ctx, event_queues, "queued",
                                         JS_NewUint32(ctx, status.event_queues_queued)) ||
        !esp32_mquickjs_set_property_ref(ctx, event_queues, "capacity",
                                         JS_NewUint32(ctx, status.event_queues_capacity)) ||
        !esp32_mquickjs_set_property_ref(ctx, event_queues, "highWater",
                                         JS_NewUint32(ctx, status.event_queues_high_water)) ||
        !esp32_mquickjs_set_property_ref(
            ctx,
            async_pollers,
            "registered",
            JS_NewUint32(ctx, status.async_pollers_registered)) ||
        !esp32_mquickjs_set_property_ref(
            ctx,
            async_pollers,
            "capacity",
            JS_NewUint32(ctx, status.async_pollers_capacity)) ||
        !esp32_mquickjs_set_property_ref(
            ctx,
            orphans,
            "pending",
            JS_NewUint32(ctx, status.orphans_pending)) ||
        !esp32_mquickjs_set_property_ref(
            ctx,
            orphans,
            "capacity",
            JS_NewUint32(ctx, status.orphans_capacity)) ||
        !sys_set_resource_object(ctx, resources, "timers", timers) ||
        !sys_set_resource_object(ctx, resources, "futures", futures) ||
        !sys_set_resource_object(ctx, resources, "eventQueues", event_queues) ||
        !sys_set_resource_object(ctx, resources, "asyncPollers", async_pollers) ||
        !sys_set_resource_object(ctx, resources, "orphans", orphans)) {
        goto fail;
    }
    JS_PopGCRef(ctx, &orphans_ref);
    JS_PopGCRef(ctx, &async_pollers_ref);
    JS_PopGCRef(ctx, &event_queues_ref);
    JS_PopGCRef(ctx, &futures_ref);
    JS_PopGCRef(ctx, &timers_ref);
    return JS_PopGCRef(ctx, &resources_ref);

