99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_sys.c
fail:
    JS_PopGCRef(ctx, &orphans_ref);
    JS_PopGCRef(ctx, &async_pollers_ref);
    JS_PopGCRef(ctx, &event_queues_ref);
    JS_PopGCRef(ctx, &futures_ref);
    JS_PopGCRef(ctx, &timers_ref);
    JS_PopGCRef(ctx, &resources_ref);
    return JS_EXCEPTION;
}

static bool sys_number_to_bounded_u32(JSContext *ctx,
                                      JSValue value,
                                      uint32_t minimum,
                                      uint32_t maximum,
                                      uint32_t *result)
{
    double number;
    uint32_t converted;

    if (!JS_IsNumber(ctx, value) || JS_ToNumber(ctx, &number, value) != 0 ||
        !isfinite(number) || number < (double)minimum || number > (double)maximum) {
        return false;
    }
    converted = (uint32_t)number;
    if ((double)converted != number) {
        return false;
    }
    *result = converted;
    return true;
}

static bool sys_validate_option_keys(JSContext *ctx,
                                     JSValue options,
                                     const char *api_name,
                                     const char *first,
                                     const char *second)
{
    const char *allowed[2] = {first, second};
    return esp32_mquickjs_validate_plain_options(
        ctx, options, api_name, allowed, second != NULL ? 2U : 1U);
}

#if defined(CONFIG_ESP32_MQUICKJS_SYS_TASK_SNAPSHOT) && CONFIG_ESP32_MQUICKJS_SYS_TASK_SNAPSHOT
static int sys_compare_tasks(const void *left, const void *right)
{
    const TaskStatus_t *left_task = left;
    const TaskStatus_t *right_task = right;

    if (left_task->xTaskNumber < right_task->xTaskNumber) {
        return -1;
    }
    if (left_task->xTaskNumber > right_task->xTaskNumber) {
        return 1;
    }
    return 0;
}

static const char *sys_task_state_name(eTaskState state)
{
    switch (state) {
    case eRunning:
        return "running";
    case eReady:
        return "ready";
    case eBlocked:
        return "blocked";
    case eSuspended:
        return "suspended";
    case eDeleted:
        return "deleted";
    case eInvalid:
    default:
        return "invalid";
    }
}

static JSValue sys_task_core(JSContext *ctx, const TaskStatus_t *task)
{
#if CONFIG_FREERTOS_SMP
#if configNUMBER_OF_CORES == 1
    (void)task;
    return JS_NewInt32(ctx, 0);
#elif defined(configUSE_CORE_AFFINITY) && configUSE_CORE_AFFINITY
    UBaseType_t mask = task->uxCoreAffinityMask;
    BaseType_t core;

    for (core = 0; core < configNUMBER_OF_CORES; ++core) {
        UBaseType_t bit = (UBaseType_t)1U << (UBaseType_t)core;

        if (mask == bit) {
            return JS_NewInt32(ctx, core);
        }
    }
    return JS_NULL;
#else
    (void)task;
    return JS_NULL;
#endif
#elif defined(configTASKLIST_INCLUDE_COREID) && configTASKLIST_INCLUDE_COREID
    if (taskVALID_CORE_ID(task->xCoreID) == pdTRUE) {
        return JS_NewInt32(ctx, task->xCoreID);
    }
    return JS_NULL;
#elif configNUMBER_OF_CORES == 1
    (void)task;
    return JS_NewInt32(ctx, 0);
#else
    (void)task;
    return JS_NULL;
#endif
}

static JSValue sys_make_task(JSContext *ctx, const TaskStatus_t *task)
{
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);

    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "id",
                                         JS_NewUint32(ctx, task->xTaskNumber)) ||
        !esp32_mquickjs_set_property_ref(
            ctx,
            object,
            "name",
            JS_NewString(ctx, task->pcTaskName != NULL ? task->pcTaskName : "")) ||
        !esp32_mquickjs_set_property_ref(
            ctx,
            object,
            "state",
            JS_NewString(ctx, sys_task_state_name(task->eCurrentState))) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "priority",
                                         JS_NewUint32(ctx, task->uxCurrentPriority)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "basePriority",
                                         JS_NewUint32(ctx, task->uxBasePriority)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "core",
                                         sys_task_core(ctx, task)) ||
        !esp32_mquickjs_set_property_ref(
            ctx,
            object,
            "stackHighWaterMarkBytes",
            JS_NewUint32(ctx, task->usStackHighWaterMark))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}
#endif

JSValue js_sys_tasks(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
#if !defined(CONFIG_ESP32_MQUICKJS_SYS_TASK_SNAPSHOT) || !CONFIG_ESP32_MQUICKJS_SYS_TASK_SNAPSHOT
    (void)argc;
    (void)argv;
    return JS_ThrowInternalError(ctx, "FreeRTOS task snapshots are not enabled");
#else
    TaskStatus_t *native_tasks = NULL;
    UBaseType_t before_count;
    UBaseType_t captured_count;
    UBaseType_t after_count;
    uint32_t limit;
    uint32_t return_count;
    uint32_t i;
    JSGCRef result_ref;
    JSGCRef tasks_ref;
    JSValue *result;
    JSValue *tasks;

    limit = CONFIG_ESP32_MQUICKJS_SYS_TASK_SNAPSHOT_MAX;
    if (argc > 0 && !JS_IsUndefined(argv[0])) {
        JSGCRef property_ref;
        JSValue *property;

        if (JS_GetClassID(ctx, argv[0]) != JS_CLASS_OBJECT) {
            return JS_ThrowTypeError(ctx, "sys.tasks(options) expects an object");
        }
        if (!sys_validate_option_keys(ctx, argv[0], "sys.tasks", "limit", NULL)) {
            return JS_EXCEPTION;
        }
        property = JS_PushGCRef(ctx, &property_ref);
        *property = JS_GetPropertyStr(ctx, argv[0], "limit");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(*property) &&
            !sys_number_to_bounded_u32(
                ctx,
                *property,
                1U,
                CONFIG_ESP32_MQUICKJS_SYS_TASK_SNAPSHOT_MAX,
                &limit)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowRangeError(
                ctx,
                "sys.tasks option 'limit' expects an integer from 1 through %u",
                (unsigned)CONFIG_ESP32_MQUICKJS_SYS_TASK_SNAPSHOT_MAX);
        }
        JS_PopGCRef(ctx, &property_ref);
    }
    before_count = uxTaskGetNumberOfTasks();
    if (before_count > CONFIG_ESP32_MQUICKJS_SYS_TASK_SNAPSHOT_MAX) {
        return JS_ThrowInternalError(
            ctx,
            "FreeRTOS task count exceeds the configured snapshot limit");
    }
    native_tasks = heap_caps_calloc(CONFIG_ESP32_MQUICKJS_SYS_TASK_SNAPSHOT_MAX,
                                    sizeof(*native_tasks),
                                    MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    if (native_tasks == NULL) {
        return JS_ThrowOutOfMemory(ctx);
    }
    captured_count = uxTaskGetSystemState(
        native_tasks,
        CONFIG_ESP32_MQUICKJS_SYS_TASK_SNAPSHOT_MAX,
        NULL);
    after_count = uxTaskGetNumberOfTasks();
    if (after_count > CONFIG_ESP32_MQUICKJS_SYS_TASK_SNAPSHOT_MAX ||
        captured_count > CONFIG_ESP32_MQUICKJS_SYS_TASK_SNAPSHOT_MAX) {
        heap_caps_free(native_tasks);
        return JS_ThrowInternalError(
            ctx,
            "FreeRTOS task count exceeds the configured snapshot limit");
    }
    qsort(native_tasks, captured_count, sizeof(*native_tasks), sys_compare_tasks);
    return_count = captured_count < limit ? captured_count : limit;
    result = JS_PushGCRef(ctx, &result_ref);
    tasks = JS_PushGCRef(ctx, &tasks_ref);
    *result = JS_NewObject(ctx);
    *tasks = JS_NewArray(ctx, 0);
    if (JS_IsException(*result) || JS_IsException(*tasks)) {
        goto task_fail;
    }
    for (i = 0; i < return_count; ++i) {
        JSValue task = sys_make_task(ctx, &native_tasks[i]);

        if (JS_IsException(task) ||
            JS_IsException(JS_SetPropertyUint32(ctx, *tasks, i, task))) {
            goto task_fail;
        }
    }
    if (!esp32_mquickjs_set_property_ref(ctx, result, "total",
                                         JS_NewUint32(ctx, captured_count)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "truncated",
                                         JS_NewBool(return_count < captured_count)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "tasks", *tasks)) {
        goto task_fail;
    }
    heap_caps_free(native_tasks);
    JS_PopGCRef(ctx, &tasks_ref);
    return JS_PopGCRef(ctx, &result_ref);

