99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_sys.c
task_fail:
    heap_caps_free(native_tasks);
    JS_PopGCRef(ctx, &tasks_ref);
    JS_PopGCRef(ctx, &result_ref);
    return JS_EXCEPTION;
#endif
}

typedef struct {
    char reason[ESP32_MQUICKJS_CONTROL_REASON_MAX + 1U];
    uint32_t delay_ms;
} sys_control_options_t;

static bool sys_parse_control_options(JSContext *ctx,
                                      const char *api_name,
                                      int argc,
                                      JSValue *argv,
                                      sys_control_options_t *options)
{
    JSGCRef reason_ref;
    JSGCRef delay_ref;
    JSValue *reason;
    JSValue *delay;

    snprintf(options->reason, sizeof(options->reason), "%s", "javascript");
    options->delay_ms = 0;
    if (argc == 0 || JS_IsUndefined(argv[0])) {
        return true;
    }
    if (JS_GetClassID(ctx, argv[0]) != JS_CLASS_OBJECT) {
        JS_ThrowTypeError(ctx, "%s(options) expects an object", api_name);
        return false;
    }
    if (!sys_validate_option_keys(ctx, argv[0], api_name, "reason", "delayMs")) {
        return false;
    }
    reason = JS_PushGCRef(ctx, &reason_ref);
    delay = JS_PushGCRef(ctx, &delay_ref);
    *reason = JS_GetPropertyStr(ctx, argv[0], "reason");
    *delay = JS_GetPropertyStr(ctx, argv[0], "delayMs");
    if (JS_IsException(*reason) || JS_IsException(*delay)) {
        goto fail;
    }
    if (!JS_IsUndefined(*reason)) {
        JSCStringBuf reason_buf;
        size_t reason_length = 0;
        const char *reason_text;
        size_t i;

        if (!JS_IsString(ctx, *reason)) {
            JS_ThrowTypeError(ctx, "%s option 'reason' expects a string", api_name);
            goto fail;
        }
        reason_text = JS_ToCStringLen(ctx, &reason_length, *reason, &reason_buf);
        if (reason_text == NULL) {
            goto fail;
        }
        if (reason_length == 0 || reason_length > ESP32_MQUICKJS_CONTROL_REASON_MAX) {
            JS_ThrowRangeError(ctx,
                               "%s option 'reason' expects 1..%u UTF-8 bytes",
                               api_name,
                               (unsigned)ESP32_MQUICKJS_CONTROL_REASON_MAX);
            goto fail;
        }
        for (i = 0; i < reason_length; ++i) {
            unsigned char byte = (unsigned char)reason_text[i];

            if (byte < 0x20U || byte == 0x7fU) {
                JS_ThrowRangeError(ctx,
                                   "%s option 'reason' must not contain ASCII control characters",
                                   api_name);
                goto fail;
            }
        }
        memcpy(options->reason, reason_text, reason_length);
        options->reason[reason_length] = '\0';
    }
    if (!JS_IsUndefined(*delay) &&
        !sys_number_to_bounded_u32(ctx, *delay, 0U, 60000U, &options->delay_ms)) {
        JS_ThrowRangeError(ctx,
                           "%s option 'delayMs' expects an integer from 0 through 60000",
                           api_name);
        goto fail;
    }
    JS_PopGCRef(ctx, &delay_ref);
    JS_PopGCRef(ctx, &reason_ref);
    return true;

fail:
    JS_PopGCRef(ctx, &delay_ref);
    JS_PopGCRef(ctx, &reason_ref);
    return false;
}

static JSValue sys_control_receipt(JSContext *ctx,
                                   esp32_mquickjs_control_action_t action,
                                   const char *reason,
                                   const esp32_mquickjs_control_receipt_t *receipt)
{
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);

    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(
            ctx,
            object,
            "action",
            JS_NewString(ctx, sys_control_action_name(action))) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "reason",
                                         JS_NewString(ctx, reason)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "generation",
                                         JS_NewUint32(ctx, receipt->generation)) ||
        !esp32_mquickjs_set_property_ref(
            ctx,
            object,
            "requestedAtMs",
            JS_NewInt64(ctx, (int64_t)receipt->requested_at_ms)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "dueAtMs",
                                         JS_NewInt64(ctx, (int64_t)receipt->due_at_ms))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

static JSValue sys_request_control(JSContext *ctx,
                                   const char *api_name,
                                   esp32_mquickjs_control_action_t action,
                                   int argc,
                                   JSValue *argv)
{
    esp32_mquickjs_runtime_t *runtime = esp32_mquickjs_get_active_runtime();
    esp32_mquickjs_control_receipt_t receipt;
    esp32_mquickjs_control_result_t result;
    sys_control_options_t options;

    if (!sys_parse_control_options(ctx, api_name, argc, argv, &options)) {
        return JS_EXCEPTION;
    }
    if (!esp32_mquickjs_request_system_control(runtime,
                                                action,
                                                options.reason,
                                                options.delay_ms,
                                                &receipt,
                                                &result)) {
        switch (result) {
        case ESP32_MQUICKJS_CONTROL_ALREADY_PENDING:
            return JS_ThrowInternalError(ctx, "system control already pending");
        case ESP32_MQUICKJS_CONTROL_INVALID_STATE:
            return JS_ThrowInternalError(ctx, "%s is unavailable in the current runtime state",
                                         api_name);
        case ESP32_MQUICKJS_CONTROL_UNAVAILABLE:
        default:
            return JS_ThrowInternalError(ctx, "%s is unavailable", api_name);
        }
    }
    return sys_control_receipt(ctx, action, options.reason, &receipt);
}

