99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_sys.c
JSValue js_sys_restart_runtime(JSContext *ctx,
                               JSValue *this_val,
                               int argc,
                               JSValue *argv)
{
    (void)this_val;
    return sys_request_control(ctx,
                               "sys.restartRuntime",
                               ESP32_MQUICKJS_CONTROL_RESTART_RUNTIME,
                               argc,
                               argv);
}

JSValue js_sys_reboot(JSContext *ctx,
                      JSValue *this_val,
                      int argc,
                      JSValue *argv)
{
    (void)this_val;
    return sys_request_control(ctx,
                               "sys.reboot",
                               ESP32_MQUICKJS_CONTROL_REBOOT,
                               argc,
                               argv);
}

JSValue js_sys_millis(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_NewInt64(ctx, esp_timer_get_time() / 1000);
}

JSValue js_sys_micros(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_NewInt64(ctx, esp_timer_get_time());
}

JSValue js_sys_freeHeap(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_NewUint32(ctx, esp_get_free_heap_size());
}

JSValue js_sys_randomHex(JSContext *ctx,
                           JSValue *this_val,
                           int argc,
                           JSValue *argv)
{
    static const char hex_digits[] = "0123456789abcdef";
    uint8_t bytes[64];
    char encoded[(sizeof(bytes) * 2U) + 1U];
    int byte_count;
    int i;
    int random_result;
    JSValue result;

    (void)this_val;
    if (argc != 1 || JS_ToInt32(ctx, &byte_count, argv[0]) != 0 ||
        byte_count < 1 || byte_count > (int)sizeof(bytes)) {
        return JS_ThrowRangeError(ctx,
                                  "sys.randomHex(byteLength) expects 1..%u bytes",
                                  (unsigned)sizeof(bytes));
    }

    if (!s_secure_random_initialized) {
        return JS_ThrowInternalError(ctx, "secure random generator is not initialized");
    }
    random_result = mbedtls_ctr_drbg_random(&s_secure_random,
                                            bytes,
                                            (size_t)byte_count);
    if (random_result != 0) {
        mbedtls_platform_zeroize(bytes, sizeof(bytes));
        return JS_ThrowInternalError(ctx,
                                     "secure random generation failed: %d",
                                     random_result);
    }
    for (i = 0; i < byte_count; ++i) {
        encoded[i * 2] = hex_digits[bytes[i] >> 4];
        encoded[(i * 2) + 1] = hex_digits[bytes[i] & 0x0f];
    }
    encoded[byte_count * 2] = '\0';
    result = JS_NewStringLen(ctx, encoded, (size_t)byte_count * 2U);
    mbedtls_platform_zeroize(bytes, sizeof(bytes));
    mbedtls_platform_zeroize(encoded, sizeof(encoded));
    return result;
}

JSValue js_sys_withTimeout(JSContext *ctx,
                             JSValue *this_val,
                             int argc,
                             JSValue *argv)
{
    esp32_mquickjs_runtime_t *runtime = esp32_mquickjs_get_active_runtime();
    uint64_t previous_deadline_us;
    uint64_t previous_scoped_deadline_us;
    uint64_t requested_deadline_us;
    uint64_t effective_deadline_us;
    uint32_t timeout_ms;
    JSValue result;

    (void)this_val;
    if (argc < 2 || !esp32_mquickjs_value_to_bounded_u32(
            ctx, argv[0], 1U, ESP32_MQUICKJS_MAX_SCOPED_TIMEOUT_MS,
            &timeout_ms)) {
        return JS_ThrowRangeError(ctx,
                                  "sys.withTimeout(timeoutMs, callback) expects timeoutMs between 1 and 60000");
    }
    if (!JS_IsFunction(ctx, argv[1])) {
        return JS_ThrowTypeError(ctx,
                                 "sys.withTimeout(timeoutMs, callback) expects a callback function");
    }
    if (runtime == NULL) {
        return JS_ThrowInternalError(ctx, "ESP32 runtime is not active");
    }

    previous_deadline_us = runtime->deadline_us;
    previous_scoped_deadline_us = runtime->scoped_deadline_us;
    requested_deadline_us = (uint64_t)esp_timer_get_time() +
                            ((uint64_t)timeout_ms * 1000ULL);
    if (previous_deadline_us == 0 || requested_deadline_us < previous_deadline_us) {
        runtime->deadline_us = requested_deadline_us;
    }
    if (previous_scoped_deadline_us == 0 ||
        requested_deadline_us < previous_scoped_deadline_us) {
        runtime->scoped_deadline_us = requested_deadline_us;
    }
    effective_deadline_us = runtime->scoped_deadline_us;

    result = esp32_mquickjs_call(ctx, runtime, argv[1], JS_NULL, 0, NULL);
    if (effective_deadline_us > 0 &&
        (uint64_t)esp_timer_get_time() >= effective_deadline_us) {
        if (JS_IsException(result)) {
            (void)JS_GetException(ctx);
        }
        runtime->deadline_us = previous_deadline_us;
        runtime->scoped_deadline_us = previous_scoped_deadline_us;
        return JS_ThrowInternalError(ctx, "sys.withTimeout() deadline exceeded");
    }
    runtime->deadline_us = previous_deadline_us;
    runtime->scoped_deadline_us = previous_scoped_deadline_us;
    return result;
}
